package gm.shoppingmall.dummy;

import java.util.Random;

public class CustomerDummy {
	private static Random rnd = new Random();
	
	private static String firstName[] = {"김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "한", "오", "서", "신", "권", "황",
            "안", "송", "류", "전", "홍", "고", "문", "양", "손", "배", "조", "백", "허", "유", "남", "심", "노", "정", "하", "곽", "성",
            "차", "주", "우", "구", "신", "임", "나", "전", "민", "유", "진", "지", "엄", "채", "원", "천", "방", "공", "강", "현", "함",
            "변", "염", "양", "변", "여", "추", "노", "도", "소", "신", "석", "선", "설", "마", "길", "주", "연", "방", "위", "표", "명",
            "기", "반", "왕", "금", "옥", "육", "인", "맹", "제", "모", "장", "남", "탁", "국", "여", "진", "어", "은", "편", "구",
            "용"
	};
	
	private static String lastName[] = {"가", "강", "건", "경", "고", "관", "광", "구", "규", "근", "기", "길", "나", "남", "노",
            "누", "다", "단", "달", "담", "대", "덕", "도", "동", "두", "라", "래", "로", "루", "리", "마", "만", "명", "무", "문", "미",
            "민", "바", "박", "백", "범", "별", "병", "보", "빛", "사", "산", "상", "새", "서", "석", "선", "설", "섭", "성", "세", "소",
            "솔", "수", "숙", "순", "숭", "슬", "승", "시", "신", "아", "안", "애", "엄", "여", "연", "영", "예", "오", "옥", "완", "요",
            "용", "우", "원", "월", "위", "유", "윤", "율", "으", "은", "의", "이", "익", "인", "일", "잎", "자", "잔", "장", "재", "전",
            "정", "제", "조", "종", "주", "준", "중", "지", "진", "찬", "창", "채", "천", "철", "초", "춘", "충", "치", "탐", "태", "택",
            "판", "하", "한", "해", "혁", "현", "형", "혜", "호", "홍", "화", "환", "회", "효", "훈", "휘", "희", "운", "모", "배", "부",
            "림", "봉", "혼", "황", "량", "린", "을", "비", "솜", "공", "면", "탁", "온", "디", "항", "후", "려", "균", "묵", "송", "욱",
            "휴", "언", "령", "섬", "들", "견", "추", "걸", "삼", "열", "웅", "분", "변", "양", "출", "타", "흥", "겸", "곤", "번", "식",
            "란", "더", "손", "술", "훔", "반", "빈", "실", "직", "흠", "흔", "악", "람", "뜸", "권", "복", "심", "헌", "엽", "학", "개",
            "롱", "평", "늘", "늬", "랑", "얀", "향", "울", "련"
	};
	
	private static String emailList[] = {"@naver.com","@gogle.com","@daume.net",
			"@gmair.com","@adfef.com","@yahoe.com","@kakag.com"
	};
	
	private static String emailId[]	= {"a","b","c","d","e","f","g","h","i","j","k",
			"l","m","n","o","p","q","r","s","t","u","w","x","y","z"
	};
	
	private static String si[] = {"서울시","광주시","제주시","포항시","시흥시",
			"수원시","부천시","안산시","전주시","천안시","용인시","고양시","창원시"
			,"파주시","김포시","진주시","광명시","원주시","아산시","익산시","양산시",
			"군포시","군산시","여수시","순천시","경주시","거제시","목포시","강릉시",
			"오산시","충주시","이천시","양주시","안동시","의왕시","하남시","광양시"
	};
	
	private static String dong[] = {"역삼동","진월동","주월동","삼구동","종로구",
			"용산구","성동구","광진구","중랑구","성북구","강북구","도봉구","노원구",
			"은평구","마포구","양천구","구로구","강서구","구로구","금천구","동작구"
			,"관악구","서초구","강남구","송파구","강동구","사상구","연제구"
	};
	
	private static String grade[] = {"1","2","3","1","1","1","1","1","1"
			,"1","1","1","1","1","1","2","2","2","1","1","1","1","1"
			,"1","1","1","1","1","1","1","1","1","1","1","1","1","1","1"
	};
	
	private static String month[] = {
			"01","02","03","04","05","06","07","08","09","10","11","12"
			,"01","03","04","05","06","07","08","09","10","11","12"
			,"01","03","04","05","06","07","08","09","10","11","12"
	};
	
	private static String day[] = {
			"01","02","03","04","05","06","07","08","09","10","11","12",
			"13","14","15","16","17","18","19","20","21","22","23","24",
			"25","26","27","28","29","30","31"
	};
	
	private static String year[] = {"70","71","72","73","74","75","76","77","78","79","80",
			"81","82","83","84","85","86","87","88","89","90",
			"91","92","93","94","95","96","97","98","99",
			"01","02","03","04","05","06","07","08","09"
	};
	
	public static void main(String[] args) {
		String name = "";
		String ssn = "";
		String tel = "";
		String email = "";
		String address = "";
		String gradeNum = "";
		
		for(int i=0;i<500;i++) {
			name = firstName[rnd.nextInt(firstName.length)] + lastName[rnd.nextInt(firstName.length)] + lastName[rnd.nextInt(firstName.length)];
			ssn = year[rnd.nextInt(year.length)]+""+month[rnd.nextInt(month.length)]+""+day[rnd.nextInt(day.length)];
			tel = "010" + (rnd.nextInt(8999)+1000) + "" + (rnd.nextInt(8999)+1000); 
			email = emailId[rnd.nextInt(emailId.length)] + emailId[rnd.nextInt(emailId.length)] +
					emailId[rnd.nextInt(emailId.length)] + emailId[rnd.nextInt(emailId.length)] 
							+ emailId[rnd.nextInt(emailId.length)] + emailList[rnd.nextInt(emailList.length)]; 
			address = si[rnd.nextInt(si.length)] + " " + dong[rnd.nextInt(dong.length)];
			gradeNum = grade[rnd.nextInt(grade.length)];
			System.out.println("insert into Customer values(customerSeq.nextval,"
					+ "'"+name+"',"
					+ "'"+ssn+"',"
					+ "'"+tel+"',"
					+ "'"+email+"',"
					+ "'"+address+"',"
					+ "'"+gradeNum+"')");
		}
	}
}





























